namespace JobCrwaler_104
{
    public class BlackList
    {
        public HashSet<string> CompanyNames { get; init; } = new HashSet<string>
        {
            "永慶房產集團_永慶房屋仲介股份有限公司",
            "舒果農企業有限公司",
            "立樂高園股份有限公司",
            "欒軒管理顧問有限公司",
            "科爾迪股份有限公司",
            "台灣邁那比股份有限公司",
            "坤侑科技股份有限公司",
            "捷通軟體股份有限公司",
            "海棠設計股份有限公司",
            "茂為歐買尬數位科技股份有限公司",
            "臺灣電視事業股份有限公司",
            "新加坡商鈦坦科技股份有限公司台灣分公司",
            "文中資訊股份有限公司",
            "創鈺國際科技股份有限公司",
            "中華資安國際股份有限公司",
            "艾新科環保材料有限公司",
            "彰化商業銀行股份有限公司",
            "新加坡商海宇顧問服務有限公司台灣分公司",
            "創世代有限公司",
            "彰化商業銀行股份有限公司",
            "台灣利優資訊科技有限公司",
            "彰化商業銀行股份有限公司",
            "環資國際有限公司",
            "慧智科技股份有限公司",
            "網軟股份有限公司",
            "日成科技股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "睿宏醫聯股份有限公司",
            "凱茂科技有限公司",
            "大安聯合醫事檢驗所",
            "曜祥網技股份有限公司",
            "社團法人台北市美僑協會",
            "台灣雨花石雲計算科技有限公司",
            "和康顧問有限公司",
            "米蘭數位傳播集團_米蘭營銷策劃股份有限公司",
            "偉欣資訊有限公司",
            "愛群生醫醫療集團_愛群婦產科診所",
            "藍色邊境健康管理顧問股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
        };

        public HashSet<string> CompanyNames_SeemsGoodButCurrentlyNo { get; init; } = new HashSet<string>
        {
            "宇匯知識科技股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
        };

        public HashSet<string> CompanyNames_HadSubmitted { get; init; } = new HashSet<string>
        {
            "沙漠魚科技股份有限公司",
            "黑訊科技股份有限公司",
            "達格互動媒體有限公司",
            "萬通教育股份有限公司",
            "宇禾數位股份有限公司",
            "玩股網有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
            "陽明海運集團_好好國際物流股份有限公司",
        };

        public IList<string> CompanyKeywords { get; init; } = new List<string>
        {
            "銀行",
            "證券",
            "財團法人",
        };

        public IList<string> JobTitleKeywords { get; init; } = new List<string>
        {
            // 判斷這邊記得統一ToUpper
            "UNITY",
            "ANALYST",
            "FIRMWARE",
        };
    }
}
